#!/bin/bash

#Εντολή αναζήτησης αρχείων μεγαλύτερα απο 10Mb στον κατάλογο ~
#Εκτέλεση της εντολής du -h σε καθένα απο αυτά για να εμφανιστεί το μέγεθος τους σε Mb
find ~ -type f -size +10M -exec du -h {} + | 

#Χρήση pipe, διοχέτευση του αποτελέσματος της προηγούμενης εντολής στην εντολή awk

#H awk αφερεί το file path απο τα ονόματα των αρχείων, αφήνοντας το όνομα και το μέγεθος
#Στη συνέχεια ακολουθεί η εντολή print
awk '{gsub(/.*\//, "", $2); print $1, $2}'| 

#Χρήση pipe, διοχέτευση του αποτελέσματος της προηγούμενης εντολής στην εντολή sort 

#Αντίστροφη ταξινόμηση και αρίθμηση λίστας αρχείων βάσει μεγέθους και αποθήκευση σε αρχείο
sort -rh | cat -n > File_list.txt

#Το αρχείο File_list.txt περιέχει μια λίστα αρχείων με τα μεγέθη τους
#Ταξινομημένη κατα φθίνουσα σειρά μεγέθους και κάθε γραμμή είναι αριθμημένη

